let isRunning= false;
let timerInterval;
let timeLeft;

const timerDisplay= document.getElementById('timer');
const startBtn= document.getElementById('start_Btn');
const stop_Btn= document.getElementById('stop_Btn');

    const startTimer= (duration)=>{
     timer= duration;

    timerInterval= setInterval(()=>{
    const minuts= parseInt(timer / 60, 10);
    const second= parseInt(timer % 60, 10);
    
    const displayMinutes= minuts< 10 ? '0' + minuts : minuts;
    const displaySeconds= second < 10 ? '0' + second : second;
    timerDisplay.innerText= displayMinutes +':'+ displaySeconds;

    if(--timer < 0){
        clearInterval(timerInterval);

        timerDisplay.innerText= 'শ্বাস ছেড়ে দাও';

        setTimeout(()=>{
            timerDisplay.innerText= 'শ্বাস নাও';

            startTimer(timeLeft);

        }, 5000)
    }
    
    }, 1000);
};

startBtn.addEventListener('click', () =>{

    if(!isRunning){
        timeLeft= 90;
        startTimer(timeLeft)
        
        isRunning= true;
    };
})

stop_Btn.addEventListener('click', ()=>{
    clearInterval(timerInterval)
    timerDisplay.innerText='শ্বাস ছেড়ে দাও'
    isRunning= false;
})



// Any Project of Manual:
// ★ First of all: html, css of total work will finish. 
// ১। আইডি ধরা-	(যে পয়েন্টগুলা ডাইনামিক হবে সেগুলা js থেকে get element by id দিয়ে ধরা) ।
// ★ এরপর ভাবতে হবে সর্বপ্রথম কোথায় ক্লিক করলাম আর কাজ শুরু হলো? 
// ২।  ঘটনা রাখার বাটি তৈরী করা- (দেওয়ার ডায়নামিক আইডির নামে এই ভাবে- নাম.এ্যাড ইভেন লিসেনারের মধ্যে কনসোল লগ এর মধ্যে কোন কিছু লিখে ব্রাউজারের কনসোলে দেখব যে ধরতে পারলাম কিনা। এভাবে ২টা বাটনই চেক দিলাম। ঠিক থাকার পরে কনসোল ২টা কেটে দিলাম, সুধু ব্লাং ২টা বাটি রইলো।)
// ৩। ঘটনা তৈরী করা। 
// ৪। ঘটনা বাটিতে রাখা।
// ৫। ঘটনা স্টেপ বাই স্টেপ বড় করে কাজ শেষ করা।
// বিঃ দ্রঃ প্রতিটা প্রজেক্টের একটা বডার থাকবে, যেখানে আসবে, আমরা যে কোন নাম দিয়ে রিসিভ করব এবং এটাতে let দিতে হবে।



// কমন কাজ শেষ হওয়ার পর এই প্রজেক্টের মেইন ঘটনা সিরিয়ালওয়াইজ বড় করাঃ
// ১। কনসোল ওপেন করে স্ট্যাট বাটনে ক্লিক করলাম আর কনসোলে মিনিট ওঠা শুরু হবে, এর কাজ। 
// ২। ইন্টেজারওয়াইজ মিনিট ও সেকেন্টে কনভার্ট করে মাঝখানে (:) দেওয়ার কাজ।
// ৩। মিনিট ও সেকেন্ট শো হইলো, এবার কমানোর কাজ। ৪নং আগে করতে হবে।
// ৪। সেট ইন্টারভাল স্টপ করার কাজ। 
// ৫। ব্রেথ আউট এর মেসেজ দেখানোর কাজ। 
// ৬। ব্রেথ ইন মেসেজ দেখানোর কাজ, 
// ৭। পুনরায় অটোমেটিক 0থেকে শুরু হওয়ার কাজ। 
// ৮। সমস্যা সমাধান- 0 পর্যন্ত যাওয়ার পর যখন আবার শুরু হতে যাবে, ব্রাউজারের কনসোলে ফলো করলে দেখা যাবে, ইরোর। 
// ৯। মিনিট ও সেকেন্ট যখন ১০এর কম হবে তখন এর আগে 0 দেখানো।  (Start বাটনের আর কোন কাজ বাকি নাই)।
// ১০। Stop বাটনে চাপ দিলে টাইমার বন্ধ হওয়ার কাজ। 
// ১১। Start বাটনে ২বার ক্লিক করলে হিবিজিবি হয়ে মিনিট ওঠে এটা বন্ধ করার কাজ। 
// ১২। বন্ধ হওয়ার পর পুনরায় Start বাটনে ক্লিক করলে কাজ শুরু হয় না, এটা সমাধানের কাজ।

 
// মেশিনের নাম কি? 	 কাজ কি ?	          প্যারেন্ট মেশিনগুলার নাম কি ? 	উপর থেকে কি পাওয়ার জন্য অপেক্ষা করে ?              সম্পূর্ণ কোডটি সঠিক ভাবে টাইপ করো।

// ১। সেট ইন্টারভাল, ধার্য্যকরা মিলিসেকেন্ট পর পর ক্লিক হবে, মূল ঘটনার ফাংশন এর প্যারেন্ট, তার থেকে সময়সীমা পাওয়ার জন্য অপেক্ষা করে।
// ঘটনায় কিছুই নাই ! কনসোলে মিনিট দেখার জন্য ঘটনা তৈরীর ফাংশনের মধ্যে সেট ইন্টারভাল এর মধ্যে কনসোল লগ এর মধ্যে ‘যে কোন কিছু’ লিখে স্টাট বাটনে ক্লিক করলে মিনিট ওঠা শুরু হবে। এই পর্যন্ত আসার পর- ইউজার ইচ্ছামত আরগুমেন্ট হিসাবে বাটিতে টাইম দিবে এবং সেটা মিনিট ও সেকেন্টে ইন্টেজারওয়াইজ কনভার্ট হয়ে আসবে এই কাজ করব।

// ২।  বাটিতে রাখলাম যেটা (আনুমানিক টাইম ৯০) এটা সরাসরি দিলেও হয়, কিন্তু সুন্দর করার জন্য একটা ভেরিঃ এর মধ্যে দিলাম। 
// * ঘটনায় গিয়ে যে কোন নাম দিয়ে (ডিউরেশন) দিয়ে রিসিভ করলাম। এটাকেও সুন্দর করার জন্য (টাইমার) যেকোন নামের ভেরিঃ এর মধ্যে রাখলাম। 
// * টাইম ধার্য্য করা- যখন ঘটনার মধ্যে টাইমার নাম পর্যন্ত আনতে পারলাম তখন এটাকে মিনিt, সেকেন্ট ও ইন্টেজারওয়াইজ কনভাট করার জন্য (নিচের লাইন) সেট ইন্টারভাল এর পেটের মধ্যে গিয়ে- 
// * পার্স ইন্ট এর পেটের মধ্যে ভেরিঃ এর নাম / ৬০দিয়ে ভাগ করতে হবে, তো করলাম, সেইম ভাবে সেকেন্ট ওয়াইজ করার জন্য / এর স্থানে % দিয়ে মিনিট ও সেকেন্ট এই ২নামের ভেরিঃ এর মধ্যে রেখে দিলাম। 
// * মিনিট ও সেকেন্ট এর মাঝে একটা (:) চিহ্ন থাকে সেটা আবার ইন্নার টেক্সের মাধ্যমে ঢুকাতে হবে, সেজন্য সেট ইন্টারভালের মধ্যেই (সেই ডিভ যেটার মাধ্যমে ব্রাউজারে দেখা যাবে), তার নাম ধরে ইন্নার টেক্স করে-  timerDisplay.innerText= minuts +':'+ second; এভাবে এটাকে (:) শো করে দিলাম, ব্রাউজারে টাইম শো হলো, কিন্তু কমতেছে না। 

// ৩। কমানোর জন্য কোন কাজ নাই, শুধু নিচের লাইনের কন্টিশনের মধ্যে টাইমারের আগে (--) দেওয়া আছে, এতেই হবে।

// ৪। টাইমার কমতে কমতে যদি ০ থেকেও কম হয়ে যায়, তখন সেট ইন্টারভাল বন্ধ করার জন্য একটা মেশিন আছে, ক্লিয়ার ইন্টারভাল, সেটা দিয়ে সেট ইন্টারভালকে একটা নাম দিয়ে ভেরিঃ এর মধ্যে রাখতে হবে, ওই নাম ক্লিয়ার ইন্টারভালের ফাস্ট ব্রাকেটের মধ্যে দিলাম, 0 এর পরে টাইমারটা স্টপ হয়ে গেলো।   কন্ডিশন- if(--timer < 0) { 
// clearInterval(এখানে নাম দিব); 
// }
 
// ৫। স্টপ হওয়ার পরে ব্রেথ আউট অর্থাৎ (শ্বাষ ছেড়ে দাও) একটা ম্যাসেজ যাতে দেয় সেজন্য কি করতে হবে ? শর্তের মধ্যেই (সেই ডিভ যেটার মাধ্যমে ব্রাউজারে দেখা যাবে), তার নাম ধরে ইন্নার টেক্স করে মেসেজটা দিব। 

// ৬। অটোমেটিক ব্রেথ ইন লেখা আসবে, শুধু এতটুকু লেখা আসার জন্য শর্তর মধ্যেই সেট ইন্টারভালের মত সেইম ফাংশন সেট টাইম আউট। তৈরী করে তার পেটের মধ্যে সেই ডিভ (যেটার মাধ্যমে ব্রাউজারে দেখা যাবে). ইন্নার টেক্স করে ব্রেথ ইন নামের মেসেজ লিখে দিব, মেসেজ দেখানোর কাজ শেষ। প্রকাশ্য যে, ইন্নার টেক্স করে (:) দেওয়াল লাইনটা if কন্ডিশনের  উপরে থাকতে হবে, নাহলে ব্রেথ আউট কথাটা দেখাবে না। 

// ৭। এবার পুনরায় মিনিট ওঠা শুরু করাকে অটো করার জন্য- if শর্তের মধ্যে এবং সেট টাইম আউটের পেটের মধ্যে মেইন ঘটনার ফাংশনের নাম দিয়ে  ফাংশনের নামের মধ্যে আবার (এর মধ্যে) বাটিতে আরগুমেন্ট এর নাম যেটা দিছিলাম (timeLeft), সেই নাম দিয়ে দিতে হবে। মানে পুনরায় তোমাকে ডাক দিলাম, তুমি প্রথম থেকে অটোমেটিক মিনিট ওঠা শুরু করো এবং ইউজার বাটিতে আরগুমেন্ট এর মাধ্যমে যে টাইম ধার্য্য করে দিছে সেই টাইম পর্যন্ত চলতে থাকো। সমস্যা হইছে, গ্লোবালী করার জন্য নিচের লাইন ফলো করো। 

// ৮। এবার যে সমস্যাটায় পড়ব যে, 0 পর্যন্ত যাওয়ার পর যখন আবার শুরু হতে যাবে, ব্রাউজারের কনসোলে ফলো করলে দেখা যাবে, ইরোর: (ইউজারের আরগুমেন্ট এর নাম) is not defined. মানে নামটা গ্লোবালী করতে হবে। গ্লোবালী করার নিয়মঃ বাটিতে সরাসরি ৯০ সেন্ট না করে ৯০কে একটা নামের মধ্যে রেখে নামকে সেন্ট করলাম এইভাবে- timeLeft = 90; বাটিতে শুধু timeLeft দিলাম, ৯০ এর পরিবর্তে। 
//     এই timeLeft এর লাইনে কোন let দেই নাই। এবার সবার উপরের লাইনে let timeLeft এভাবে দিলেই গ্লোবালী হয়ে গেলো। এখানে const দিলে হাবে না। 

// ৯। এখানে মিনিট ও সেকেন্ট এর আগে 0 দেখাতে হলে সেট ইন্টারভাল এর মধ্যে কিছু কৌশল অবলম্বন করতে হবে, যেমন- minuts < 10 ? '0' + minuts : minuts; অর্থাৎ মিনিট যখন ছোট হবে ১০থেকে তখন কি হবে ? একটা 0 থাকবে, তারপরে + হবে মিনিট (অন্যথায় / else): মিনিট  0 ছাড়াই থেকে যাবে,
//    এরপর এটাকে যে কোন একটা নামের ভেরিঃ এর মধ্যে রেখে দিলাম, সেইম ভাবে সেকেন্টও করলাম। যখন মিনিট, সেকেন্ট ২টাকেই ২টা নামের মধ্যে রাখলাম, তখন ওইযে ইন্নার টেক্স করে (:) দেখাইছিলাম, সেখানে 
//   timerDisplay.innerText= এর পরে মিনিট ও সেকেন্ট না লিখে ভেরিঃ এর নাম ২টা দিয়ে দিলই শেষ। 

// ১০। ফাংশন বন্ধ করার যে মেশিন, ক্লিয়ার ইন্টারভাল নামে, সেটার কলের মধ্যে সেট ইন্টারভাল এর ভেরিঃ এর নামটা দিব, সেট ইন্টারভাল এর শুরুতে const দেওয়া আছে সেটা কেটে দিব, সবার উপরের লাইন let টাইমার ইন্টারভাল (মানে সেট ইন্টারভাল এর ভেরিঃ এর নাম) দিব, (মানে গ্লোবালী করা যেটাকে বলে) এরপর বাটনে ক্লিক করলে মিনিট বন্ধ হয়ে যাবে। 

// ১১। false একটা রিজার্ভ করা কীওয়ার্ড। এই কীওয়ার্ডকে একটা ভেরিঃ এর মধ্যে সবার উপরের লাইনে রাখলাম এই ভাবে let isRunning= false; এবার স্ট্যাট বাটন চাপলে যেহেতু সমস্যাটা হয় তাই স্ট্যাট বাটনের মধ্যে গিয়ে ইফ কন্ডিশন দিয়ে এর পেটের মধ্যে ওখানের সবকিছু কাট পেষ্ট করে দিব, 
//        তার পরের লাইনেই  isRunning= true; এটা দিব এবং ইফ কন্ডিশনের কলের মধ্যে প্রথমে !চিহ্ন দিয়ে তারপর উপরের লাইনের ভেরিঃ এর নামটা দিলেই সমস্যাটা সমাধান। 

// ১২। স্ট্যাট বাটনে ক্লিক করলে নতুন মিনিট ওঠা শুরু হবে না। এটা সমাধানের জন্য স্টপ বাটনের পেটের মধ্যে নিচের লাইনে isRunning= false; পেস্ট করে দিলেই সমাধান। এটা বোঝার কিছু নাই, মুখস্ত করতে হবে। 


// ?= কি হবে, 0 তারপরে + হবে মিনিট। 
// minuts < 10 ? 0 + minuts : minuts;s