const calculatTip= () => {
  const billAmount= parseFloat (document.getElementById('billAmount').value);
  const tipPercentage= parseFloat (document.getElementById('tipPercentage').value);
  
  if(isNaN(billAmount) || isNaN(tipPercentage)){
    document.getElementById('result').innerText='Please Enter A Valid Number';
    return;
  }
  
  const tipAmount=  (billAmount * tipPercentage) / 100;
  const totalAmount= billAmount + tipAmount;
  document.getElementById('result').innerHTML= `
  
  <h3>  Tip Amount: $ ${tipAmount.toFixed(2)}  </h3>
  <h3>  Total Amount: $ ${totalAmount.toFixed(2)}  </h3>
  `;    
};


// ১। বাটন ধরা। 
// ২। নম্বর বক্সের ভ্যালু টেনে বের করা। 
// ৩। নম্বর বক্স ব্লাংক থাকা অবস্থায় বাটনে ক্লিক করলে এ্যালার্ট দেখানোর কাজ করা।
// ৪। পার্সেন্টিস বের করা ও মূল এ্যামাউন্ট এর সাথে পার্সেন্টিস যোগ করার কাজ। 
// ৫। ২টা এ্যামাউন্ট দেখানোর কাজ। 
// ৬। দশমিক এর পরে সংখ্যা দেখানোর প্রয়োজন হলে যেন ২সংখ্যা দেখায় এই কাজ করা। 


// ১। বাটন ধরা। 
// ২। ২টা নম্বর বক্সই আলাদা ভাবে ভ্যালু বের করে ২টা নামের মধ্যে রাখলাম। 
// ৩। এলার্ট দেখানোর জন্য একটা কন্ডিশন সেট করতে হবে এভাবে-   if(isNaN(Number_1) || isNaN(Number_2)){
                                                                // document.getElementById('result').innerText='KKK';
                                                                // return;}
      // এর ব্যাখ্যাটা হচ্চে যদি ইজনান অর্থাৎ (নম্বর_1) খালি থাকে || অথবা (নম্বর_2) খালি থাকে তাহলে ইন্নার টেক্সের মাধ্যমে যে লেখাটা রিটার্ণ করলাম, সেটা এলার্ট হিসাবে দেখাবা। 
// ৪। পার্সেন্টিস বের করার নিয়ম হলো প্রথমে গুন করা পরে ১০০ দিয়ে ভাগ করা। তো (billAmount * tipPercentage) / 100; এভাবে পার্সেন্টিস বের করে একটা ভেরিঃ মধ্যে রাখলাম। 
//    এরপর এটাকে আবার মূল এ্যামাউন্ট এর সাথে যোগ করে একটা ভেরিঃ মধ্যে রাখলাম। 

// ৫। দেখানোর জন্য এইচ.টি.এম.এল এর যে ডিভ তৈরী করা আছে রেজাল্ট নামে সেটাকে ২য় বার গেট এলিমেন্ট বাই আইডি দিয়ে ধরে ইন্নার এইচ টি এম এল করে ব্যাকটিকের মধ্যে h2 ট্যাগ তৈরী করে ৳() এভাবে ডাইনামিক করে দিলাম। 
//    এবার যে সমস্যাটা হলো যে, পার্সেন্টিস ঠিকঠাক শো হচ্ছে, কিন্তু যোগ না করে পাশাপাশি এ্যাড হয়ে যাচ্ছে। এটা সলফ করার জন্য ২টা নম্বর বক্সের ভ্যালুর লাইন ২টাকে পার্স ফ্লোট করে দিলাম। 
// ৬। ডলার সাইন দিয়ে যে ডাইনামিক করলাম, সেখানে দিয়ে .toFixed(2) টু ফিক্স করে দিলেই হয়ে যাবে। 
