const addTask= ()=>{
const taskInput= document.getElementById('taskInput');
const taskInputValue= taskInput.value.trim();

if(! taskInputValue == ''){
    const taskListUl= document.getElementById('taskList');
    const li= document.createElement('li')
    li.innerHTML='<input type="checkbox"> ' + taskInputValue + ' <button onclick="deleteTask(this)">Delete</button>';
    taskListUl.appendChild(li)
    taskInput.value= '';
}
else{
    alert('Please Add a Task');
}
}

const deleteTask= (btn) => {
   const li= btn.parentNode;
   li.parentNode.removeChild(li);
};



const deletedTaskChecked=()=> {
   const taskList= document.getElementById('taskList');
   const checkboxes= document.querySelectorAll('input[type="checkbox"]:checked');
   checkboxes.forEach(checkbox => {
   const li= checkbox.parentNode;
   li.parentNode.removeChild(li); 
   })
   
};

//১। সর্বপ্রথম যে বাটনে ক্লিক করব সেই বাটনের কাজই করতে হয়। 
//২। ফাংশন বা বাটনের মধ্যে ঘটনা তৈরী শুরু করাঃ টেক্স বক্স এর ভ্যালু কালেক্ট করার কাজ।
//৩। ভ্যালুর পরে ট্রিম দিয়ে কল করার সুবিধা কি ? 
//৪। টেক্স বক্স ইমটি থাকা অবস্থায় এ্যাড বাটনে ক্লিক করলে এলার্ট দেখানোর কাজ।
//৫। এলার্ট দেখানোর পরের ধাপ হচ্ছে টেক্স বক্সে টাইপ করে বাটন চাপলে নিচে চেকবস্ক, টেক্স, ও ডিলিট শো হওয়ার কাজ করা। 
//৬। li কে ul এর এ্যাপেন্ট চাইল্ড বানানো।
//৭। এ্যাড বাটনে ক্লিক করার পর টেক্স বক্স খালি হবে এটা করা। 
//৮। প্রতিটা li বাটনের সাথে যে ডিলিট বাটন থাকবে, সেই বাটনে ক্লিক করলে ডিলিট হওয়ার কাজ করা। 
//৯। চেকবস্কে যতগুলা ক্লিক করা থাকবে সবগুলা একসাথে ডিলিট হবেে এই কাজ করা। 

//১। এ্যাড ইভেন লিসেনার দিয়ে বাটনের বাটি তৈরী না করে এখানে নতুন নিয়মে করলাম। জাস্ট js থেকে ফাংশন তৈরী করে ফাংশনের নামটা বাটনের অন ক্লিক েএর মধ্যে দিয়ে কল করে দিলাম। এবার এই ফাংশনের মধ্যে যত ঘটনা থাকবে বাটনে ক্লিক করলে সব ব্রাউজারে দেখা যাবে।
//২। প্রথমে টেক্সবক্সের আইডিটা ফাংশনের মধ্যে ধরতে হবে, এটা আগে থেকেই জানা আছে, যে নামে ধরলাম সেই নামের ভ্যালু বের করে আবার আরেকটা ভেরিঃ এর মধ্যে রাখলাম, ওই ভেরিঃ এর নাম কনসোল লগ করে দেখলাম যে, টেক্স বক্সে যা লিখি সেটা ব্রাউজারের কনসোলে পাই কি না ।
//৩। ইউজিার আরগুমেন্ট দেওয়ার সময় আগে বা পরে অবাঞ্চিত স্পেস দিতে পারে সেটা ইগনোর করার জন্য। 
//৪। ইফ শর্তের মধ্যে একটু ঘুরিয়ে বলে দিলাম যে টেক্স ইনপুট ভ্যালু যদি খালি না হয় তবে কোন এলার্ট দেখাবে না। অর যদি খালি হয় তবে এ্যালস পার্টে যা থাকবে সেটা এলার্ট হিসাবে দেখাবে।
//৫। html থেকে আইডি সহ একটা ul তৈরী করলাম ওই আইডিটা আবার ইফ শর্তের মধ্যে get element by ID দিয়ে ধরলাম। তারপর js থেকে document.createElement('li') এর মাধ্যমে html এর মধ্যে li তৈরী করে আবার li নামের মধ্যে রাখলাম।
//   ওই li এর মধ্যে ইন্নার html এর মধ্যে li.innerHTML= ''; এভাবে ‘<input type="checkbox">’ এটা html থেকে করে এনে ডাবল কটেশনের মধ্যে পেস্ট করলাম। এবার শুধু চেক বক্স আসবে, বাকি টেক্সগুলো চেক বক্সের পরে দেখানোর জন্য সবার শেষে সিঙ্গেল কোটেশনের পরে + সাইন দিয়ে taskInputValue দিয়ে দিব, সেইম ভাবে html থেকে ডিলিট বাটন তৈরী করে taskInputValue + ‘এখানে পেস্ট করে দিব।’ 
//৬। অর্থাৎ ইফ শর্তের মধ্যে ২য় লাইনে ক্রিয়েট এলিমেন্ট করে li বানাইলাম, তারপরে নিচে আরো কাজ করলাম, সবগুলাকে ইফ এর প্রথম লাইন ইউএল এর এ্যাপেন্ট চাইল্ড বানাইলাম এই ভাবে- taskListUl.appendChild(li);
//৭। taskInput.value= ''; এখানে টেক্সবক্স এর আইডিকে getElementById দিয়ে ধরে যে নামের মধ্যে রাখলাম সেই নাম এর পরে . দিয়ে ভ্যালু দিতে হবে !
//৮। নিচে একটা ফাংশন তৈরী করলাম, তার নামটা html এর মধ্যে বাটন তৈরী করে অনক্লিক এর মধ্যে পেস্ট করে অনক্লিক ও নাম সহ কাট করে js এর মধ্যে বাটনের ভিতরে দিয়ে নিচে ফাাংশনের মধ্যে কনসোল লগ করে ব্রাউজারে চেক দিলাম, ক্লিক করলে কাজ হয় কি না ! কাজ হওয়ার পর- 
//   স্পেসিফিক ভাবে এই বাটনই ডিলিট হবে এটা বোঝানোর জন্য উপরে ডিলিট এর মধ্যে ফাংশনের নামের কলের মধ্যে রিজার্ভ করা কী-ওয়ার্ড this (মানে এটাই ডিলিট করব) দিয়ে আরগুমেন্ট পাঠাবো এবং নিচে ফাংশনের কলের মধ্যে যে কোন নাম দিয়ে আবার রিসিভ করব। রিসিভ করার পর কনসোল লগের মধ্যে রিসিভ করা নাম দিয়ে ব্রাউজারের কনসোলে গেলে দেখা যাবে পুরা বাটনের কোর্টটুকুই চলে আসছে মানে স্পেসিফিক ভাবে পুরাটা ধরতে পারছে, এবার ডিলিট করার কাজ করতে হবে। 
//   সবকিছুই ডিলিট করতে চাইলে এর প্যারেন্ট সহ ডিলিট করতে হবে আর সেইজন্য রিসিভ করা নাম btn এর প্যারেন্ট কে এটা বোঝার জন্য কনসোলের মধ্যে btn.parentNode লিখে ব্রাউজারের কনসোলে দেখতে হবে, প্যারেন্ট শো হয় কি না শো হওয়ার পর- কনসোল থেকে btn.parentNode বের করে একটা li এর মধ্যে রাখলাম। পরের লাইনে আবার কনসোলের মধ্যে li.parentNode লিখে কনসোলে গেলাম যে, ব্রাউজারের কনসোলে ul দেখায় কি না ? ul শো হওয়ার পর- 
//   li.parentNode.removeChild(li) এখানে বোঝার ব্যাপার হলো যখন li.parentNode থাকবে- তখন সেটা আর li থাকবে না ul হয়ে যাবে। তো li.parentNode.removeChild(li) এখানে বোঝানোর বিষয় হলো এটা যে, ul তোমার ভিতর থেকে আমি রিমুভ চাইল্ড করব (li) কে। কাজ শেষ। এবার ডিলিট হবে ইনশাআল্লাহ্।
//৯। প্রথমে html এর মধ্যে আরেকটা বাটন তৈরী করলাম, তার অনক্লিকের মধ্যে যে নামে কল করলাম, ওই নামে js থেকে ১টা ফাংশন ক্রিয়েট করে তার মধ্যে কনসোল লগ করে চেক দিলাম যে, বাটন ধরা হইছে কি না ! html এ একটা আইডি সহ ul তৈরী করা আছে, (উপরে যেটা একবার ধরা হয়েছে), ওইটা আবার get element by Id দিয়ে আবার ধরে একটা নামের মধ্যে রাখলাম। পরের লাইনে- document.querySelectorAll() (মানে এর কলের মধ্যে যে নাম থাকবে, ওই নামের যতগুলা এলিমেন্ট সে পাবে, সব সিলেক্ট করবে) কলের মধ্যে এটা 'input[type="checkbox"]:checked' দিয়ে একটা নামের মধ্যে রাখলাম। 
//   এবার ওই নাম ধরে কনসোল লগ করলে দেখাযাবে যে, যতগুলা চেকবক্সে ক্লিক করা আছে ব্রাউজারের কনসোলে একটা এ্যারের মধ্যে অতোগুলা ইনপুট দেখাচ্ছে। আমরা জানি এ্যারের মধ্যে থেকে প্রতিটা এলিমেন্টকে আলাদা আলাদা পাইতে হলে লুপ চালাইতে হয়, তো আমি ফর-ইজ লুপ চালাইলাম। 
//   (কুয়ারী সিলেক্টর এর নাম.ফর ইজ) checkboxes.forEach(checkbox => {
//                                 (checkbox); }) মানে চেক বক্সেস এর মধ্যে থেকে আমরা এক একটা করে চেক বক্স পাব। (চেক বক্স নামের স্থানে অন্য নাম দিলেও হয়)। এবার ওই চেক বক্সকে কনসোল লগ করলে ব্রাউজারের কনসোলে এ্যারের মধ্যে আর নাই আলাদা আলাদা ইনপুট দিচ্ছে। 
//   এবার ওই আলাদা ইনপুটএর সবকিছু একসাথে ডিলিট করতে হলে অবশ্যই প্যারেন্ট ধরে ডিলিট করতে হবে ! তো প্যারেন্ট বের করার জন্য ফর ইজ এর কলের মধ্যে যে নাম আছে সেটা.প্যারেন্ট নোট দিলাম, এটাকে আবার একটা ভেরিঃ এর মধ্যে রাখলাম। পরবর্তীতে ভেরিঃ এর নাম.আবার প্যারেন্ট নোট.রিমুভ চাইল্ড(এর মধ্যে li) দিলাম অর্থাৎ ভেরিঃ এর নাম ধরলাম li, তো li কে প্যারেন্ট নোট করলে ul হয়ে যাবে, তো এবার বললাম- ul তোমার মধ্যে যে li আছে তাকে . দিয়ে রিমুভ চাইল্ড করলাম, কাজ শেষ।
