const generatePassword =()=> {
   const lengthPass= document.getElementById('lengthPass').value
   const miniLibrary= 'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890-=`~!@#$%^&*()_+';

  let getRandomWizeNumber= '';

  for(i= 0; i< lengthPass; i++){
   const randomIndex= Math.round(Math.random() * miniLibrary.length);
   const randomChar= miniLibrary[randomIndex];
   getRandomWizeNumber += randomChar;
  }

  document.getElementById('showPassword').innerText= getRandomWizeNumber;
};









// ১। বাটন ধরা। 
// ২। নম্বর বক্সের ভ্যাল্যু টেনে বের করা। 
// ৩। পাসওয়ার্ড দেওয়ার সম্ভাব্য সংখ্যাগুলো টাইপ করা।
// ৪। ইউজার যে সংখ্যা বক্সে দিবে, সেই কয়টা সংখ্যা টাইপ করা সংখ্যা থেকে র‌্যানডম এর অর্ডার অনুযায়ী বেছে নিয়ে শো করবে, এটাই আমাদের কাজের উদ্দেশ্য। তো এটা করতে হলে আগে লুপ চালাইয়া দেখতে হবে যে, ইউজার যে সংখ্যা দিবে সেই কয় বার ১,২,৩,৪ এভাবে প্রিন্ট করে কি না ।
// ৫। লুপের মধ্যে ম্যাথ.রাউন্ড ও ম্যাথ.র‌্যানডম সেট করা। সর্বোচ্চ ১০ পর্যন্ত সংখ্যা আসবে এটা চেঞ্জ করে পাসওয়ার্ড দেওয়ার জন্য যে সংখ্যা সেট করে রাখছি এর ল্যাংথ পর্যন্ত যাতে আসে এটার কাজ করা। 
// ৬। ইউজার যে কোন ইনপুট দিলো, সেটা র‌্যানডম এর মাধ্যমে কারসেট এর ল্যাংকথ পর্যন্ত একেকবার একেকটা রাউন্ড এর মাধ্যমে লেজ বিহীন সংখ্যা পেলাম। এবার যে সংখ্যা পেলাম মিনি লাইব্রেরীর এর সেই নম্বরে যেই লেটারটা থাকবে সেটা শো হবে এই কাজ করা। 
// ৭। যে লেটারগুলো পেলাম, সেগুলো একটা খালি ভেরিঃ এর মধ্যে রাখার কাজ। 
// ৮। খালি ভেরিঃ এর মধ্যে যা জমা হতে থাকবে, সেগুলো দেখানোর কাজ। 


// ১। বাটন ধরার জন্য জেএস এ একটা ফাংশন ক্রিয়েট করে তার নামটা html বাটন এর অন ক্লিক এর মধ্যে দিয়ে কল করে দিলাম। 
// ২। ভ্যাল্যু বের করার জন্য document.getElementById('lengthPass').value এভাবে করে এটাকে একটা নামের মধ্যে রাখতে হয়। 
// ৩। যে সংখ্যাগুলোর মধ্যে ইউজার পাসওয়ার্ড দেওয়ার সম্ভাবনা আছে, সেই সংখ্যাগুলো টাইপ করে একটা নামের ভেরিঃ এর মধ্যে রাখব।
// ৪। তো এবার ভ্যাল্যুটাকে ল্যাংথ ওয়াইজ লুপ এর আওতায় আনলাম এই ভাবে-   for(i= 0; i<= lengthPass; i++){
                                                                                                // console.log(i)    
                                                                                                                                                                                            // } 
      // কনসোলে ১,২,৩,৪,৫ আসলে লাইন ঠিক আছে এইবার... কনসোল থেকে i কেটে দিয়ে র‌্যানডম Math.random() এভাবে দিয়ে বাটনে চাপ দিলে একেকবার 
      // একেকটা নম্বর আসবে ঠিক এই ভাবে- 0.2678801773716347। এবার এটাকে 10 এর মধ্যে পাওয়ার জন্য 10 দিয়ে গুন দিতে হবে এই ভাবে- console.log(Math.random() * 10) 10 এর মধ্যে পাওয়ার কাজ শেষ।
      // লেজ বিহীন করার জন্য 'Math.random() * 10' এই অংশটুকু কাট করে ম্যাথ রাউন্ট এর কলের মধ্যে Math.round(এই খানে) পেস্ট করে দিতে হবে। ব্যাস লেজবিহীন পেয়ে গেলাম।

// ৫। শুধু 10 কেটে দিয়ে * এর পরে charset.length দিয়ে দিলাম।
// ৬। কারসেট মানে যার মধ্যে সব সংখ্যাগুলো স্টোর করে রাখা হয়েছে, আর র‌্যানডম ইনডেক্স হলো অর্ডার করা। অর্থাৎ স্টোর করা নম্বরের মধ্যে থেকে যাতে র‌্যানডমের অর্ডার অনুযায়ী লেটার পাই সেই জন্য কারসেট এর মধ্যে র‌্যানডম ইনডেক্স দিয়ে এটাকে console.log(miniLibrary[randomIndex]) এর কলের মধ্যে দিলাম যে ব্রাউজারের কনসোলে শুধু লেটারগুলো পাই কি না ? হ্যাঁ পাই। পাওয়ার পরে এটাকে একটা ভেরিঃ এর মধ্যে রাখলাম। 
// ৭। খালি বাক্সের মধ্যে রাখার জন্য ফর লুপের উপরে একটা ইম্পটি ভেরিঃ নিলাম এভাবে- let getRandomWizeNumber= ''; তবে let দিয়ে নিতে হবে যেহেতু এটা চেঞ্জ হবে তাই। ওই কোটেশনের মধ্যে জমা হবে। এবার ফর লুপের মধ্যে আবার getRandomWizeNumber += randomChar; এটা দিয়ে দিব। মানে উপরের খালি ভেরিঃ এর সাথে প্রথমে randomChar এটাকে যোগ করলাম, তারপর = দিয়ে এটাকে আবার getRandomWizeNumber এর মধ্যে অর্থাৎ খালি বক্সের মধ্যেই রাখলাম। 
    // এবার কিন্তু র‌্যানডম থেকে যেটা পাচ্ছি সব খালি বাস্কের মধ্যে জমা হচ্ছে, এবার এটাকে দেখানোর কাজ। 
//৮। দেখানোর জন্য html এর মধ্যে আইডি সহ একটা ব্লাংক ডিভ তৈরী করলাম। এই আইডির নাম কপি করে জেএস এর ফর লুপের বাইরে নিচে গিয়ে ডুকুমেন্ট.গেট এলিমেন্ট বাই আইডি দিয়ে ধরলাম এরপর .innerText= getRandomWizeNumber; এভাবে শো করে দিলাম, হয়ে গেলো।