const getWeather = ()=> {
    const city= document.getElementById('cityInput').value;
    const apiKey = '77af05ba4662bb14b3774c4630850ea1';              
    const apiUrl = `https://api.openweathermap.org/data/2.5/weather?q=${city}&appid=${apiKey}&units=metric`;

    fetch(apiUrl)
    .then(res => res.json())
    .then(data => {
        const weatherInfo= document.getElementById('weatherInfo')
        const discription = data.weather[0].description;
        const temperature= data.main.temp;
        const windSpeed= data.wind.speed;
        const humidity= data.main.humidity;

        weatherInfo.innerHTML= `
        <p> Discription: ${discription} </p> 
        <p> Temperature: ${temperature} &#8451</p> 
        <p> Humidity: ${humidity} %</p> 
        <p> WindSpeed: ${windSpeed} m/s </p>
        `;
    })

    .catch(error => {
        console.error('Opps!, Sorry', error);
        document.getElementById('weatherInfo').innerText='city Not Found!';
    })


    if(!city == ''){

    }
    else{
         alert('Please Type Your Division Name !')
    }         
}


// ১। যেখানে ক্লিক করলাম আর কাজ শুরু হলো সর্বপ্রথম সেটার (বাটনের) কাজ ।
// ২। সার্ভার থেকে এপিআই ফেস করা- (২নং থেকে ৫নং পর্যন্ত ফেস করার কাজ, প্রতিটা অপশন ভেঙ্গে ভেঙ্গে বোঝানোর জন্য পয়েন্ট আকারে করা হলো)।
// ৩। ইউজার টেক্সবক্সে ইচ্ছামত ডিভিশন এর নাম দিবে, ও সেটার ম্যাসেজ, লিংক এর সিটি নেম এর মধ্যে পৌছাবে এই কাজ করা। 
// ৪। লিংক এর মধ্যে থাকা সিটি নেম ও এপিআই কী ডাইনামিক করা। 
// ৫। এপিআই আনা শেষ, এবার এটা ফেস করার কাজ করা। 
// ৬। Temperature কে ইউনিটে কনভার্ট করে দুই সংখ্যায় দেখানো। 
// ৭। ডিগ্রি বা সেলসিয়াস আনার কাজ করা।
// ৮। টেক্স বক্সে উল্টাপাল্টা কিছু চাপলে অথবা কোন কারনে এ্যারোর খাইলে সেটাকে ক্যাচ করে ধরে কনসোলের ব্রাউজারে ও টেক্স বক্সের নিচে কোন একটা এ্যালার্ট দেখানোর কাজ করা। 

// ১। বাটনে অনক্লিকের মধ্যে যে নাম দিয়ে কল করলাম, জেএস থেকে সেই নামের একটা ফাংশন বানাইলাম। এবার বুঝতে হবে যে, আমরা যে সিটির নাম লিখে ক্লিক করলাম আর কারেন্ট ওয়েদারগুলা আসলো, কিভাবে আসতেছে ? এটা একটা এপিআই এর মাধ্যমে সার্ভার থেকে আসতেছে। এপিআই পাওয়ার জন্য- 
// ২। Weather api সাইট এর Current weather data থেকে লিংক কপি করে জেএস এর যে কোন নামের ভেরিঃর মধ্যে রাখলাম। এটা আবার ডায়নামিক হবে, তাই ব্যাকটিক এর মধ্যে রাখলাম। 
// ৩। টেক্সবক্সের আইডি ধরে গেট এলিমেন্ট বাই আইডি করে নিলাম। ডকুমেন্ট থেকে লাইনের শেষ পর্যন্ত কাট করে কনসোল লগের মধ্যে দিয়ে বাটনে চাপ দিলে ব্রাউজারের কনসোলে সম্পূর্ণ লাইনটুকু দেখাবে, কারন এটার সাথে.ভ্যালু দেই নাই। এবার.ভ্যালু দেওয়ার পরে দেখা গেলো যে, বক্সের মধ্যে যা লিখছি, ব্রাউজারের কনসোলে তাই দেখাচ্ছে। 
//    এবার কনসোল লগ কেটে দিয়ে মূল লাইনটুকু একটা নামের ভেরিঃ এর মধ্যে রাখলাম অর্থাৎ ইউজার তার ইচ্ছামত যে ইনপুট দিবে সেটা এই নামের মধ্যে আসবে। 
// ৪। ডাইনামিক করার জন্য সেকেন্ট ব্রাকেটের আগে ডলার সাইন দিয়ে ব্রাকেটের মধ্যে যা আছে কেটে দিয়ে ভ্যালুর নাম দিলাম ও এপিআই কী আনার জন্য পুনরায় Weather api সাইটে গিয়ে আমার নামের উপরে ক্লিক করে My Api Keys অপশনে ক্লিক করলে একটা API কী পাব। তবে আমার নামে লগইন করা থাকতে হবে! সেটা কপি করে আবার সেইম ভাবে পূর্বের লিংক যেভাবে একটা নামের ভেরিঃ এর মধ্যে রাখছিলাম, সেইম ভাবে নামের মধ্যে রাখলাম এবং সেইম ভাবে ডাইনামিক করে দিলাম।
//    প্রকাশ্য যে, এপিআই কী এর নিচের লাইনে এপিআই ইউআরএল থাকতে হবে, নাহলে কাজ করবে না। 
// ৫। ফেস করার জন্য fetch লিখে কলের মধ্যে লিংকটা দিতে হয় তারপর লাইনের শেষে.then এর কলের মধ্যে respons যেহেতু পাব তাই respons লিখতে হয়। এবার লিংক যেহেতু একটা নামের মধ্যে রাখছি, তাই ফেসের কলের মধ্যে লিংক না দিয়ে নামটা দিয়ে দিব এবং পরের লাইনে .then(এর এই কলের মধ্যে কি দেন রেসপন্স দেন তো রেসপন্সকে জেসনে কনভার্ট করার জন্য এই কলের মধ্যেই এভাবে সেইম লিখব res => res.json()) 
//    জেসনে কনভাট হওয়ার পরে আমরা ডেটা পাব তাই পরের লাইনে গিয়ে আবার .then(কি দেন ? জেসনে কনভার্ট হইছে এবার ডেটা দেন তো ডেটা পেলাম কি না চেক করার জন্য এই কলের মধ্যে সেইম ভাবে data=> con.log(data) করে টেক্স বক্সে ডিভিশনের নাম দিয়ে বাটন চাপলে ব্রাউজারের কনসোলে ওয়েদারের বর্তমান সম্পূর্ণ আপডেট শো করবে!) এবার কনসোল লগ ডেটা সহ কেটে দিয়ে সেকেন্ট ব্রাকেট দিব। টের মধ্যে- data. ওয়েদার এর যে কয়টা অপশন দেখাবো যেমন- 
//    weather, temp, wind Speed, humidity প্রতিটা অপশনের পাত ডট দিয়ে দিয়ে সঠিক ভাবে লিখে দিব এবং পুরা লাইনটাকে আলাদা ভাবে একেকটা নামের ভেরিঃ এর মধ্যে রাখব, এভাবে সবগুলো অপশন করব। এরপর যে ডিভের মাধ্যমে শো হবে সেই ডিভের নাম.getElementByID(আইডি নেম) এভাবে ধরে একটা নামের ভেরিঃ মধ্যে রাখলাম। এবার ওয়েদার থেকে যে কারেন্ট ডেটাগুলো কালেক্ট করে ৪টা নামের মধ্যে রাখলাম, এইগুলা কিন্তু এই ডিভের মধ্যে দেওয়া হয় নাই। তো একাধিক এলিমেন্ট দেওয়ার জন্য innerHTML='' করতে হয়, করলাম। 
// ৬। লিংক এর ব্যাকটিক এর মধ্যে স্পেস না দিয়ে &units=metric এটা লিখলে সমাধান।
// ৭। ইন্নার এইচটিএমএল এর মধ্যে ট্যাম্পারেচার এর লাইনের শেষে </p> এর আগে &#8451 এই কোট দিলে ডিগ্রি সেলসিয়াস আসবে। আবার মিলি সেকেন্ট দেখানোর জন্য সেইম ভাবে (m/s) দিয়ে দিব, পার্সেন্ট দেখানোর জন্য হিউমিডিটি এর পরে % দিয়ে দিব।
// ৮। .দেন এর ব্রাকেট শেষ এর পরে .দিয়ে .catch(এই কলের মধ্যে একটা এ্যারো ফাংশন বানাবো এই ভাবে- (যে কোন মিনিংফুল নাম বা) error => {
//                                                                                                                    console.error('Opps!, Sorry'error উপরের error নাম দেওয়া আছে, তাই এখানে দিয়ে দিলাম)
//                                                                                                                  }) এটা শুধুমাত্র ব্রাউজারের কনসোলে দেখাবে। টেক্স বক্সের নিচে দেখানোর জন্য- নিচের লাইনেই শো করার ডিভ এর আইডিটা গেট এলিমেন্ট বাই আইডির মাধ্যমে ধরলাম.innerText= 'Citi Not Fount' ব্যাস হয়ে গেলো। 