const extractText=()=>{
     const fileInput= document.getElementById('imageInput');
     const outPutDiv= document.getElementById('output')

     const imageFile= fileInput.files[0];

     if(!imageFile){
               outPutDiv.innerText='Please Select an image file !'
               return;
          }
          Tesseract.recognize(imageFile, 'eng').then(({data})=>{
                    outPutDiv.innerText= data.text;
               })
          }
          
          
          
// সর্বপ্রথমঃ Tesseract.js ওয়েবসাইট এর সিডিএন থেকে কোড কপি করে HTML এর Head এর মধ্যে পেস্ট করতে হবে। 
// এরপর HTML থেকে একটা ইনপুট এইরকম  <input type="file" accept="image/*" id="imageInput"> থাকবে, (মানে ফাইল আপলোডের জন্য), ১টা বাটন থাকবে, যার অনক্লিকে একটা ফাংশনের নাম দিয়ে কল করা থাকবে, ও ব্রাউজারে টেক্স ফেস করার জন্য একটা ব্লাংক ডিভ আইডি সহ তৈরী করলাম।
// HTML এ কল করা নামে js থেকে একটা ফাংশন তৈরী করে তার পেটের মধ্যে ইনপুট এর id ধরে GetElementById'id Name' এভাবে ধরলাম। সেইম ভাবে ব্লাংক ডিভকেও ধরলাম। এই একটাই ফাংশন এর মধ্যে সব কাজ করতে হবে। 

// ১। যতগুলা Image ই থাকুক সে ১নং ইনডেক্স যেটা সেটাই ধরবে এই কাজ করা। 
// ২। যদি ইমেজ সিলেক্ট না করেই কালেক্ট টেক্স বাটনে চাপ দেই, তবে একটা এলার্ট আসবে, এই কাজ করা।
// ৩। টেসের‌্যাক্ট (লাইব্রেরীর) এর সাথে ইমেজকে পরিচয় করানো। 



// ১।  ইনপুট ট্যাগের আইডি Js থেকে যে নামে ধরলাম, সেই নাম.files[0]; এটাকে আবার ভেরিঃ মধ্যে রাখলাম।
// ২। HTML এর ইনপুট এর আইডি js থেকে যে নামে ধরলাম সেই নাম ইফ শর্তের কলের মধ্যে প্রথমে !দিয়ে তারপর সেই নাম দিলাম, (মানে ফল্স)। এবার এই ফাংশনের পেটের মধ্যে ব্লাংক ডিভ, যেটার মধ্যে টেক্সগুলো শো হবে, সেটার আইডির নাম.innerText= 'এই লেখাগুলো এলার্ট হিসাবে দেখাবে' দিলাম এবং পরের লাইনে রিটার্ণ করে বের করে দিলাম।
// ৩। টেসের‌্যাক্ট.recognized(imageFile, 'eng').then(({data})=>{
//      এই পেটের মধ্যে শো করার ডিভের নাম.innerTect= data.text (টেসের‌্যাক্ট এর লাইব্রেরীর টেক্সের মধ্যে ঢুকতে হলে প্রথমে data তারপরে ডট দিয়ে text দিতে হবে)।
//      })