//১নং ফাংশন
const generateRGBColor= ()=>{
const r= Math.floor(Math.random() * 255);
const g= Math.floor(Math.random() * 255);
const b= Math.floor(Math.random() * 255);
  return`rgb(${r}, ${g}, ${b})`
};
// console.log(generateRGBColor()); এই লাইনটা শুধুমাত্র উপরের কাজটুকু ঠিক আছে কিনা সেটা ব্রাউজারের কনসোলে দেখার জন্য।

// নম্বর ৩টি পেয়ে যাওয়ার পরে ২য় ফাংশন তৈরী করে প্রথম ফাংশনের নাম ধরে কল করব ২য় ফাংশনের মধ্যে এবং সেটাকে কালার নামের মধ্যে রাখলাম। 
// কালারটা দেখাবো কোন বক্সে সেটার আইডি ধরে কালার বক্স নামের মধ্যে রাখলাম। এই কলার বক্সের ব্যাকগ্রাউন্ড কালার হিসাবে যে কোন কালার দিলে হয়ে যায়, কিন্তু 
// কালার হিসাবে আমরা দিব ওই র‌্যানডম থেকে পাওয়া ৩টি নম্বর অর্থাৎ ব্যাকগ্রাউন্ড কালার এর ভ্যালু হিসাবে ওই কালার নামটা দিলে ৩টি নম্বর আমরা বার বার পাব। 
// ২য় ফাংশনের নাম ধরে নিচে কল করব, তাহলে ব্রাউজারে রিফ্রেস করলে কালার চেঞ্জ হবে। 

// আমরা জানি যে, p ট্যাগের মধ্যে কিছু কোড প্রতিনিয়ত যাচ্ছে, সেটাকে কপি করতে হবে তাই html থেকে p ট্যাগ এর আইডিকে কালার বক্সের স্টাইল লাইনের নিচেই ধরা হল। 
// এই p ট্যাগের কোড প্রথমে সিলেক্ট, তারপর কপি করতে হলে টেক্সটা ওপেন করতে হবে, তো ওপেন করার সিসটেম হলো ইন্নার টেক্স, এই ভাবে লিখতে হবে- colorCode.innerText= color এই লাইনটি থাকতে হবে এবং ব্রাউজারে রিফ্রেশ করলে কালারের কোড দেখা যাবে। 
// কালার কোড দেখার জন্য এই ২লাইনই যথেষ্ট। এবার কপি বাটনের কাজ শুরু। 

//HTML এর কপি বাটন এর আইডি ধরব ২য় ফাংশনের ভিতরেই এবং .দিয়ে addEventListener('click' এখানে একটা এনোনিমাস ফাংশন তৈরী করব।)
//  এবার এই এ্যানোনিমাস ফাংশনের নিচে ২য় ফাংশনের বাইরে আরেকটা এ্যারো ফাংশন বানাবো যার নম্বর (৩)।
// কিভাবে কপি বাটন এর কাজ হবে- 

// ১। এই (৩) নং ফাংশনের নামটা এ্যানোনিমাস ফাংশনের মধ্যে দিয়ে কল করব। 
// ২। (৩) নং ফাংশনের মধ্যে p ট্যাগের HTML এর আইডিটা ধরব, যেটা আগেও কালার কোড নামে ধরছিলাম। সেটা সেইম নামেই আবার ধরব। প্রকাশ্য যে, এই ফাংশনটা 
      // (২)নং ফাংশনের নিচে থাকবে, উপরে থাকলে কাজ করবে না। 
// ৩। ৩নং ফাংশনের মধ্যে HTML এর মধ্যে Input এলিমেন্ট ক্রিয়েট করার জন্য document.creatElement('input') বানিয়ে একটা নাম দিয়ে দিলাম, মানে আমরা কোড কপি করব কপি করতে হলে ইনপুট এর মধ্যে করতে হয়।
// ৪। তার পরের লাইনে ওই ইনপুট ট্যাগকে বডির এ্যাপেন্ট চাইল্ড বানাইলাম। 
//৫। P ট্যাগের কোড, মানে বাটনে ক্লিক করলে যে কোডটা কপি হবে, যেটা কালার কোড নাম দেওয়া, ওইটাকে প্রথমে লিখে ওর ইন্নার টেক্স ওপেন করব এই ভাবে- colorCode.innerText;
//৬। এই ওপেন করা ইন্নার টেক্সকে ইনপুট ট্যাগের ভ্যালু হিসাবে রেখে দিলাম একই লাইনে এই ভাবে- inputTag.value = colorCode.innerText; কোন কোড কপি করতে হলে ইন্নার টেক্স ওপেন করে এভাবে ভ্যালু হিসাবে কপি করতে হয়।
//৭। ওই ওপেন করা ইন্নার টেক্সকে সিলেক্ট করার জন্য একটা কীওয়াড আছে সেটা সেট করলাম এই ভাবে inputTag.select();
//৮। সিলেক্ট হওয়ার পরে কপি করার কাজ। কপি করার জন্য একটা কীওয়াড আছে সেটা সেট করলাম এই ভাবে document.execCommand('copy');
//৯। কপি করা হয়ে গেলে ইনপুট ট্যাগ আর লাগবে না তাই HTML থেকে যাতে রিমুভ হয়ে যায় সেজন্য যেভাবে উপরে এ্যাপেন্ট চাইল্ড করছি, সেইম সেইভাবে রিমুভ চাইল্ড করব, এই কমান্ড- document.body.removeChild(inputTag); কপি হয়ে গেলো।
//১০। কপি হইলো কিনা বোঝার জন্য ৩নং ফাংশনে একটা এ্যালার্ট সেট করব।
//১১। সর্বশেষ কাজ- জেনারেট নিউ কালার নামে একটা বাটন থাকবে, সেটা ক্লিক করলে কালার চেঞ্জ হবে, এটা যেভাবে বানাবো !
//    নিচে ৪নম্বর এ আরেকটা নরমল ফাংশন বানাবো, নিচে updateColor() নামে যেটা কল করছিলাম, সেটাকে এই ফাংশনের মধ্যে দিয়ে দিব।
//    HTML এ আরেকটা বাটন বানাবো, যার মধ্যে লেখা থাকবে Generat New Color বাটনের অন ক্লিক এর মধ্যে ৪নং ফাংশনের নামটা দিয়ে দিলেই সব কাজ শেষ।

//(২)নং ফাংশনঃ

const updateColor= ()=>{
const color= generateRGBColor();
const colorBox= document.getElementById('colorBox')
colorBox.style.backgroundColor= color;
const colorCode= document.getElementById('colorCode')

colorCode.innerText= color;

const coppyButton= document.getElementById('coppyButton').addEventListener('click', ()=>{
     coppyColorCode();
    })
}

// //৩নং ফাংশন।
const coppyColorCode= ()=>{
  const colorCode= document.getElementById('colorCode');
  const inputTag= document.createElement('input');
  document.body.appendChild(inputTag);
  inputTag.value= colorCode.innerText;

  inputTag.select();
  document.execCommand('copy');
  document.body.removeChild(inputTag);
  alert("কপি করা হয়েছে!");
}

function generatNewColorBtn(){
  updateColor();
}